# yolov8_custom.yaml
nc: 3  # Number of classes (update to match your dataset)
scales:  # Model scale (nano, small, medium, large, xlarge)
  n:  # YOLOv8n (nano)
    depth_multiple: 0.33  # Scales layer depth
    width_multiple: 0.25  # Scales layer channels
    backbone:  # Backbone layers
      - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
      - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
      - [-1, 3, C2f, [128, True]]   # 2
      - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
      - [-1, 6, C2f, [256, True]]   # 4
      - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
      - [-1, 6, C2f, [512, True]]   # 6
      - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
      - [-1, 3, C2f, [1024, True]]  # 8
    head:  # Detection head
      - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 9
      - [[-1, 6], 1, Concat, [1]]  # 10
      - [-1, 3, C2f, [512]]  # 11
      - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
      - [[-1, 4], 1, Concat, [1]]  # 13
      - [-1, 3, C2f, [256]]  # 14
      - [-1, 1, Detect, [nc]]  # 15